In [2]:
# base (Python 3.11.7)

In [13]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline
import warnings
warnings.filterwarnings('ignore')

In [23]:
df = pd.read_csv('data/raw.csv')

In [24]:
df.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [25]:
df.shape

(1000, 8)

In [27]:
# Data checks to be performed
"""
1. Check for missing values
2. Check for duplicates
3. Check for data types
4. Check for unique values in categorical columns
5. Check statistics of dataset
6. Check various categories present different categorical column
"""

'\n1. Check for missing values\n2. Check for duplicates\n3. Check for data types\n4. Check for unique values in categorical columns\n5. Check statistics of dataset\n6. Check various categories present different categorical column\n'

In [28]:
df.isna().sum()

gender                         0
race/ethnicity                 0
parental level of education    0
lunch                          0
test preparation course        0
math score                     0
reading score                  0
writing score                  0
dtype: int64

In [29]:
df.duplicated().sum()

0

In [30]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      1000 non-null   object
 5   math score                   1000 non-null   int64
 6   reading score                1000 non-null   int64
 7   writing score                1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

In [31]:
df.nunique()

gender                          2
race/ethnicity                  5
parental level of education     6
lunch                           2
test preparation course         2
math score                     81
reading score                  72
writing score                  77
dtype: int64

In [32]:
df.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

In [33]:
df.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [35]:
{col: df[col].unique() for col in df.columns}

{'gender': array(['female', 'male'], dtype=object),
 'race/ethnicity': array(['group B', 'group C', 'group A', 'group D', 'group E'],
       dtype=object),
 'parental level of education': array(["bachelor's degree", 'some college', "master's degree",
        "associate's degree", 'high school', 'some high school'],
       dtype=object),
 'lunch': array(['standard', 'free/reduced'], dtype=object),
 'test preparation course': array(['none', 'completed'], dtype=object),
 'math score': array([ 72,  69,  90,  47,  76,  71,  88,  40,  64,  38,  58,  65,  78,
         50,  18,  46,  54,  66,  44,  74,  73,  67,  70,  62,  63,  56,
         97,  81,  75,  57,  55,  53,  59,  82,  77,  33,  52,   0,  79,
         39,  45,  60,  61,  41,  49,  30,  80,  42,  27,  43,  68,  85,
         98,  87,  51,  99,  84,  91,  83,  89,  22, 100,  96,  94,  48,
         35,  34,  86,  92,  37,  28,  24,  26,  95,  36,  29,  32,  93,
         19,  23,   8], dtype=int64),
 'reading score': array([ 72,  90,  95,  57,  78,  83,  43,  64,  60,  54,  52,  81,  53,
         75,  89,  32,  42,  58,  69,  73,  71,  74,  70,  65,  87,  56,
         61,  84,  55,  44,  41,  85,  59,  17,  39,  80,  37,  63,  51,
         49,  26,  68,  45,  47,  86,  34,  79,  66,  67,  91, 100,  76,
         77,  82,  92,  93,  62,  88,  50,  28,  48,  46,  23,  38,  94,
         97,  99,  31,  96,  24,  29,  40], dtype=int64),
 'writing score': array([ 74,  88,  93,  44,  75,  78,  92,  39,  67,  50,  52,  43,  73,
         70,  58,  86,  28,  46,  61,  63,  53,  80,  72,  55,  65,  38,
         82,  79,  83,  59,  57,  54,  68,  66,  62,  76,  48,  42,  87,
         49,  10,  34,  71,  37,  56,  41,  22,  81,  45,  36,  89,  47,
         90, 100,  64,  98,  51,  40,  84,  69,  33,  60,  85,  91,  77,
         27,  94,  95,  19,  35,  32,  96,  97,  99,  15,  30,  23],
       dtype=int64)}

In [36]:
# Define numerical and categorical columns
numeric_features = [features for feature in df.columns if df[feature].dtype != 'O']
categorical_features = [features for feature in df.columns if df[feature].dtype == 'O']

# print columns
print('We have {} numerical features : {}'.format(len(numeric_features), numeric_features))
print('We have {} categorical features : {}'.format(len(categorical_features), categorical_features))

NameError: name 'features' is not defined